Example output of the `terraform show -redacted` flag:

```
$ ~/terraform/bin/terraform show -redacted terraform.tfplan

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # (sensitive value) will be created
  + resource "gitlab_group_variable" "(sensitive value)" {
      + description       = (sensitive value)
      + environment_scope = (sensitive value)
      + group             = (sensitive value)
      + hidden            = (known after apply)
      + id                = (known after apply)
      + key               = (sensitive value)
      + masked            = (known after apply)
      + protected         = (known after apply)
      + raw               = (sensitive value)
      + value             = (sensitive value)
      + variable_type     = (sensitive value)
    }

  # (sensitive value) will be updated in-place
  ~ resource "tailscale_dns_preferences" "(sensitive value)" {
        id        = (sensitive value)
      ~ magic_dns = (sensitive value)
    }

  # (sensitive value) will be destroyed
  # (because tailscale_tailnet_settings.(sensitive value) is not in configuration)
  - resource "tailscale_tailnet_settings" "(sensitive value)" {
      - devices_approval_on                         = (sensitive value) -> null
      - devices_auto_updates_on                     = (sensitive value) -> null
      - devices_key_duration_days                   = (sensitive value) -> null
      - id                                          = (sensitive value) -> null
      - network_flow_logging_on                     = (sensitive value) -> null
      - posture_identity_collection_on              = (sensitive value) -> null
      - regional_routing_on                         = (sensitive value) -> null
      - users_approval_on                           = (sensitive value) -> null
      - users_role_allowed_to_join_external_tailnet = (sensitive value) -> null
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ admin                              = (sensitive value)
```

As you can see, all _before_ and _after_ attribute values are redacted, along with resource addresses which may contain `for_each` keys which could also be sensitive.